---
kind: property
id: P:Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.Scale
source: html/6e205342-be80-6bcd-725c-1b4774f5d2ec.htm
---
# Autodesk.Revit.DB.IFC.IFCExtrusionCalculatorOptions.Scale Property

The scaling factor for length measurements from the default Revit units to the export units.

## Syntax (C#)
```csharp
public double Scale { get; set; }
```